---
kind: method
id: M:Autodesk.Revit.DB.FormatOptions.CanSuppressSpaces
source: html/23417a33-48fe-80fc-9336-08396dc64b90.htm
---
# Autodesk.Revit.DB.FormatOptions.CanSuppressSpaces Method

Checks whether spaces can be suppressed for the display unit in this FormatOptions.

## Syntax (C#)
```csharp
public bool CanSuppressSpaces()
```

## Returns
True if spaces can be suppressed, false otherwise.

## Exceptions
- **Autodesk.Revit.Exceptions.InvalidOperationException** - UseDefault is true in this FormatOptions.